{
  "@context": "https://schema.org",
  "@type": "DefinedTerm",
  "@id": "urn:uor:concept:intrinsic-prime-definition",
  "name": "Intrinsic Prime Definition",
  "description": "The formal mathematical definition of an intrinsic prime as an element that satisfies conditions of irreducibility, non-unit status, and the prime property.",
  "inDefinedTermSet": {
    "@type": "DefinedTermSet",
    "name": "UOR Concepts",
    "@id": "urn:uor:concept-set:uor"
  },
  "termCode": "UOR-C-134",
  "text": "An intrinsic prime is formally defined as an element p in a domain D that satisfies three essential conditions that establish its fundamental and irreducible nature.\n\nThe first condition is irreducibility, which states that p cannot be expressed as a product of two non-unit elements in D. This means that p cannot be factored into simpler, non-trivial components within the domain. It represents a fundamental element that cannot be decomposed further.\n\nThe second condition is non-unit status, which requires that p is not a unit (invertible element) in D. Units in a domain are elements that have multiplicative inverses, and while they are important for structural reasons, they do not contribute to the prime decomposition of elements. This condition ensures that p represents a genuine building block rather than just a scaling factor.\n\nThe third condition is the prime property, which states that if p divides a product ab, then p must divide either a or b. This property, sometimes called Euclid's lemma, is essential for ensuring the uniqueness of prime factorizations. It establishes that primes behave in a way that preserves the algebraic structure needed for unique factorization.\n\nThese three conditions together define what makes an element an intrinsic prime and distinguish it from other elements in the domain. This definition generalizes the concept of prime numbers from the integers to arbitrary domains, maintaining the essential properties that make primes useful as building blocks for all objects.",
  "mathExpression": [
    "p \\in D \\text{ is an intrinsic prime if:}",
    "1. \\text{If } p = ab \\text{ then either } a \\text{ or } b \\text{ is a unit in } D",
    "2. p \\text{ is not a unit in } D",
    "3. \\text{If } p \\mid ab \\text{ then } p \\mid a \\text{ or } p \\mid b"
  ],
  "isRelatedTo": [
    {
      "@type": "DefinedTerm",
      "name": "Unique Factorization",
      "@id": "urn:uor:concept:factorization-theorem"
    },
    {
      "@type": "DefinedTerm",
      "name": "Prime Properties",
      "@id": "urn:uor:concept:prime-properties"
    }
  ],
  "author": {
    "@type": "Organization",
    "name": "UOR Framework"
  },
  "dateCreated": "2025-04-22T00:00:00Z",
  "dateModified": "2025-04-22T00:00:00Z",
  "version": "1.0"
}