{
  "@context": "https://schema.org",
  "@type": "DefinedTerm",
  "@id": "urn:uor:concept:meaning-representation",
  "name": "Meaning Representation",
  "description": "The canonical representation of meaning as a structural pattern within the prime coordinate space, allowing for observer-invariant encoding of semantic content.",
  "termCode": "UOR-C-318",
  "inDefinedTermSet": {
    "@type": "DefinedTermSet",
    "name": "UOR Framework Concepts"
  },
  "mathExpression": [
    "M(x) = \\prod_{i=1}^{n} p_i^{\\alpha_i} \\text{ where } p_i \\text{ are semantic primes and } \\alpha_i \\text{ are semantic weights}"
  ],
  "relatedConcepts": [
    "urn:uor:concept:canonical-representation",
    "urn:uor:concept:prime-decomposition",
    "urn:uor:concept:observer-coherence",
    "urn:uor:concept:semantic-prime-decomposition",
    "urn:uor:concept:meaning-coherence-field"
  ],
  "sourceText": "Meaning Representation within the UOR framework provides a foundational approach to semantics based on prime decomposition principles. Just as mathematical objects can be decomposed into prime factors, meaning can be represented as patterns within prime coordinate spaces. This representation allows semantic content to be encoded in a form that preserves its essential structure across different observer perspectives.\n\nThe meaning of a concept or proposition is represented through its decomposition into semantic primes—the irreducible meaning units that form the basis of all semantic constructions. These semantic primes combine according to coherence principles that minimize representational complexity while maximizing fidelity to the intended meaning.\n\nUnlike traditional semantic networks or logical formalisms, meaning representation in UOR doesn't merely connect symbols according to arbitrary rules. Instead, it reveals the intrinsic structural relationships that constitute meaning itself. This approach bridges the gap between syntax and semantics by showing how meaning emerges naturally from structural patterns in the prime coordinate space.\n\nCrucially, UOR meaning representation addresses the context-sensitivity of meaning through observer reference frames. Different observers may decompose meaning into different semantic primes, but the UOR framework ensures these decompositions are related through coherence-preserving transformations. This maintains the invariant properties of meaning across different perspectives and contexts.",
  "dateCreated": "2025-04-22T00:00:00Z",
  "dateModified": "2025-04-22T00:00:00Z"
}