{
  "@context": "https://schema.org",
  "@type": "DefinedTerm",
  "@id": "urn:uor:concept:semantic-prime-decomposition",
  "name": "Semantic Prime Decomposition",
  "description": "The factorization of semantic content into irreducible meaning units (semantic primes) that form the basis for all complex meanings within a given reference frame.",
  "termCode": "UOR-C-319",
  "inDefinedTermSet": {
    "@type": "DefinedTermSet",
    "name": "UOR Framework Concepts"
  },
  "mathExpression": [
    "S(x) = \\prod_{i=1}^{k} s_i^{w_i} \\text{ where } s_i \\text{ are semantic primes and } w_i \\text{ are semantic weights}"
  ],
  "relatedConcepts": [
    "urn:uor:concept:prime-decomposition",
    "urn:uor:concept:meaning-representation",
    "urn:uor:concept:observer-dependent-meaning",
    "urn:uor:concept:trilateral-coherence"
  ],
  "sourceText": "Semantic Prime Decomposition extends the UOR principle of prime factorization to semantic domains. Just as numbers can be uniquely decomposed into prime factors, semantic content can be decomposed into semantic primes—the irreducible units of meaning that cannot be further simplified within a given reference frame.\n\nThis decomposition process reveals the inherent structure of meaning by identifying both the fundamental meaning components and their relationships. Each semantic prime represents an atomic meaning that combines with others through specific semantic operations analogous to multiplication in numerical domains. The coefficients or exponents in the prime decomposition represent semantic weights or emphasis factors that modulate how prominently each semantic prime contributes to the overall meaning.\n\nThe structure of semantic prime decomposition varies across different contexts and observer reference frames. Within scientific discourse, semantic primes might include fundamental concepts like 'causation,' 'property,' or 'system.' In artistic contexts, they may include notions like 'form,' 'expression,' or 'perspective.' The UOR framework acknowledges this context-sensitivity while providing transformation mechanisms between different semantic prime bases.\n\nCrucially, semantic prime decomposition upholds the coherence norm principle by preferring decompositions that minimize representational complexity while preserving essential meaning. This provides a criterion for identifying canonical representations of meaning that remain consistent across different observer perspectives.\n\nThrough semantic prime decomposition, complex ideas, narratives, and arguments can be analyzed for their essential structure, revealing patterns of meaning that might otherwise remain obscured by surface-level linguistic representations.",
  "dateCreated": "2025-04-22T00:00:00Z",
  "dateModified": "2025-04-22T00:00:00Z"
}