{
  "@context": "https://schema.org",
  "@type": "DefinedTerm",
  "@id": "urn:uor:concept:harmonic-prime-decomposition",
  "name": "Harmonic Prime Decomposition",
  "description": "The factorization of musical structures into irreducible harmonic components that reveal the intrinsic mathematical relationships underpinning musical experience.",
  "termCode": "UOR-C-333",
  "inDefinedTermSet": {
    "@type": "DefinedTermSet",
    "name": "UOR Framework Concepts"
  },
  "mathExpression": [
    "H(f) = \\prod_{i=1}^{n} p_i^{\\alpha_i} \\text{ where } p_i \\text{ are prime frequencies and } \\alpha_i \\text{ are harmonic weights}",
    "C(n_1, n_2, ..., n_k) = \\prod_{i=1}^{k} H(f_i)^{w_i} \\text{ where } H(f_i) \\text{ are constituent harmonics and } w_i \\text{ are voicing weights}"
  ],
  "relatedConcepts": [
    "urn:uor:concept:prime-decomposition",
    "urn:uor:concept:musical-coherence-field",
    "urn:uor:concept:musical-observer-frames",
    "urn:uor:concept:spectral-musical-analysis",
    "urn:uor:concept:spectral-interpretation"
  ],
  "sourceText": "Harmonic Prime Decomposition extends the UOR principle of prime factorization to musical domains. This concept provides a foundational approach to musical analysis by decomposing harmonic structures into their irreducible prime components.\n\nThe central insight is that musical frequencies can be analyzed as ratios relative to a fundamental tone, and these ratios decompose into products of prime numbers raised to specific powers. For example, the perfect fifth (frequency ratio 3:2) decomposes as 3¹×2⁻¹, while the major third (5:4) decomposes as 5¹×2⁻², revealing their intrinsic mathematical structure.\n\nAny musical entity—whether a single note, chord, progression, or complete composition—can be represented through its harmonic prime decomposition. This representation captures the essential mathematical relationships that underlie musical structures across different cultures, notational systems, and traditions.\n\nHarmonic prime decomposition reveals several profound insights:\n\n1. The simplest and most universally appealing harmonies tend to have the simplest prime decompositions\n2. Consonance and dissonance correlate with complexity metrics in prime coordinate space\n3. Harmonic progressions form coherence-preserving trajectories through prime coordinate space\n4. Different musical traditions emphasize different regions of prime harmonic space\n\nThis concept bridges the longstanding divide between mathematical and experiential approaches to music theory by showing how prime decomposition directly relates to perceptual qualities. It explains why certain harmonic relationships (octaves, fifths, thirds) appear consistently across diverse musical cultures, while also accounting for cultural variation through observer reference frames.\n\nUnlike traditional music theory, which relies on arbitrary notational conventions and culture-specific interpretations, harmonic prime decomposition reveals the invariant mathematical structures that constitute music's universal language.",
  "dateCreated": "2025-04-24T00:00:00Z",
  "dateModified": "2025-04-24T00:00:00Z"
}