{
  "@context": "https://schema.org",
  "@type": "DefinedTerm",
  "@id": "urn:uor:concept:observer-dependent-meaning",
  "name": "Observer-Dependent Meaning",
  "description": "The context-specific interpretation of meaning relative to a particular observer reference frame, while maintaining invariant structural properties across reference frame transformations.",
  "termCode": "UOR-C-321",
  "inDefinedTermSet": {
    "@type": "DefinedTermSet",
    "name": "UOR Framework Concepts"
  },
  "mathExpression": [
    "M_O(x) = T_{O \\rightarrow O'}(M_{O'}(x)) \\text{ where } T \\text{ is a coherence-preserving transformation between observer frames}"
  ],
  "relatedConcepts": [
    "urn:uor:concept:observer-reference-frames",
    "urn:uor:concept:frame-transformations",
    "urn:uor:concept:observer-invariant-properties",
    "urn:uor:concept:meaning-representation",
    "urn:uor:concept:semantic-prime-decomposition"
  ],
  "sourceText": "Observer-Dependent Meaning addresses the fundamental context-sensitivity of semantic content through the UOR framework's observer reference frame mechanism. While traditional theories of meaning often struggle with contextual variation, UOR embraces this variability while maintaining structural invariance.\n\nEvery meaning exists relative to an observer reference frame—a specific context, perspective, or interpretive stance. These frames determine which semantic primes are relevant and how they combine to constitute meaning. A scientific observer frame may decompose meaning using primes related to causality and empirical verification, while an aesthetic frame might employ primes related to expression and form.\n\nCrucially, the UOR framework provides precise transformation operators that map meanings between different observer frames. These transformations preserve invariant structural properties while adapting the representation to different semantic contexts. This resolves the apparent tension between contextual meaning and universal communication—different observers can access the same invariant meaning structure through their own reference frames.\n\nThis approach illuminates how the same statement can carry different meanings in different contexts without falling into radical relativism. The frame-dependent aspects of meaning undergo predictable transformations, while core invariant properties remain stable across all valid interpretations.\n\nObserver-dependent meaning connects to broader UOR principles by showing how representational coherence emerges from the interaction between universal structural patterns and context-specific interpretations. It provides a rigorous framework for analyzing how meaning transforms across disciplines, cultures, and individual perspectives while maintaining essential coherence.",
  "dateCreated": "2025-04-22T00:00:00Z",
  "dateModified": "2025-04-22T00:00:00Z"
}